The method that Revit will invoke to obtain a URL address which provides more information about the server.
  Namespace:   Autodesk.Revit.DB.Plumbing
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
string GetInformationLink()
  Visual Basic
Function GetInformationLink As String
  Visual C++
String^ GetInformationLink()
 Return Value
 The URL providing server information.
 See Also
  IPipePressureDropServer Interface
  Autodesk.Revit.DB.Plumbing Namespace